<a href="https://colab.research.google.com/github/gyujin0450/RPRG_PartII/blob/master/p184_reshape2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ch06.2 reshape2

In [2]:
install.packages("reshape2")
library(reshape2)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

also installing the dependency ‘plyr’

In [5]:
data <- read.csv('data.csv')
data

   Date     Customer_ID Buy
1  20150101 1           3
2  20150101 2           4
3  20150102 1           2
4  20150101 2           3
5  20150101 1           2
6  20150103 2           3
7  20150102 4           6
8  20150102 5           1
9  20150103 1           5
10 20150103 2           1
11 20150103 4           8
12 20150107 3           4
13 20150107 5           3
14 20150103 5           5
15 20150104 1           5
16 20150104 2           8
17 20150104 3           5
18 20150105 5           6
19 20150106 2           6
20 20150106 3           6
21 20150107 1           9
22 20150107 5           7

In [6]:
# 넓은 형식(wide format)으로 변경하기 --> 엑셀의 피봇결과와 동일
# dcast(데이터셋, 앞변수 ~ 뒷변수, 적용함수)
wide <- dcast(data, Customer_ID ~ Date, sum)
wide

Using Buy as value column: use value.var to override.

  Customer_ID 20150101 20150102 20150103 20150104 20150105 20150106 20150107
1 1           5        2        5        5        0        0         9
2 2           7        0        4        8        0        6         0
3 3           0        0        0        5        0        6         4
4 4           0        6        8        0        0        0         0
5 5           0        1        5        0        6        0        10

In [7]:
write.csv(wide, "wide.csv", row.names = FALSE)
wide <- read.csv("wide.csv")
wide
colnames(wide) <- c("Customer_ID","day1","day2","day3","day4","day5","day6","day7")
wide

  Customer_ID X20150101 X20150102 X20150103 X20150104 X20150105 X20150106
1 1           5         2         5         5         0         0
2 2           7         0         4         8         0         6
3 3           0         0         0         5         0         6
4 4           0         6         8         0         0         0
5 5           0         1         5         0         6         0
  X20150107
1  9
2  0
3  4
4  0
5 10

  Customer_ID day1 day2 day3 day4 day5 day6 day7
1 1           5    2    5    5    0    0     9
2 2           7    0    4    8    0    6     0
3 3           0    0    0    5    0    6     4
4 4           0    6    8    0    0    0     0
5 5           0    1    5    0    6    0    10

In [8]:
# 넓은 형식을 긴 형식으로 변경
# melt(데이터셋, id='컬럼명')
long <- melt(wide, id='Customer_ID')
long

   Customer_ID variable value
1  1           day1      5
2  2           day1      7
3  3           day1      0
4  4           day1      0
5  5           day1      0
6  1           day2      2
7  2           day2      0
8  3           day2      0
9  4           day2      6
10 5           day2      1
11 1           day3      5
12 2           day3      4
13 3           day3      0
14 4           day3      8
15 5           day3      5
16 1           day4      5
17 2           day4      8
18 3           day4      5
19 4           day4      0
20 5           day4      0
21 1           day5      0
22 2           day5      0
23 3           day5      0
24 4           day5      0
25 5           day5      6
26 1           day6      0
27 2           day6      6
28 3           day6      6
29 4           day6      0
30 5           day6      0
31 1           day7      9
32 2           day7      0
33 3           day7      4
34 4           day7      0
35 5           day7     10

In [10]:
name <- c("Customer_ID","Date","Buy")
colnames(long) <- name
head(long)

  Customer_ID Date Buy
1 1           day1 5
2 2           day1 7
3 3           day1 0
4 4           day1 0
5 5           day1 0
6 1           day2 2

In [11]:
data("smiths")
smiths

  subject    time age weight height
1 John Smith 1    33  90     1.87
2 Mary Smith 1    NA  NA     1.54

In [14]:
# 파라미터 순서에 관계 없는가?
# 
long <- melt(id =1:2, smiths)
long

  subject    time variable value
1 John Smith 1    age      33.00
2 Mary Smith 1    age         NA
3 John Smith 1    weight   90.00
4 Mary Smith 1    weight      NA
5 John Smith 1    height    1.87
6 Mary Smith 1    height    1.54

In [15]:
# 긴형식을 넓은 형식으로 변경하기
dcast(long, subject + time ~ ...)

  subject    time age weight height
1 John Smith 1    33  90     1.87
2 Mary Smith 1    NA  NA     1.54

In [16]:
data('airquality')
str(airquality)

'data.frame':	153 obs. of  6 variables:
 $ Ozone  : int  41 36 12 18 NA 28 23 19 8 NA ...
 $ Solar.R: int  190 118 149 313 NA NA 299 99 19 194 ...
 $ Wind   : num  7.4 8 12.6 11.5 14.3 14.9 8.6 13.8 20.1 8.6 ...
 $ Temp   : int  67 72 74 62 56 66 65 59 61 69 ...
 $ Month  : int  5 5 5 5 5 5 5 5 5 5 ...
 $ Day    : int  1 2 3 4 5 6 7 8 9 10 ...

In [18]:
head(airquality)

  Ozone Solar.R Wind Temp Month Day
1 41    190      7.4 67   5     1
2 36    118      8.0 72   5     2
3 12    149     12.6 74   5     3
4 18    313     11.5 62   5     4
5 NA     NA     14.3 56   5     5
6 28     NA     14.9 66   5     6

In [19]:
names(airquality) <- toupper(names(airquality))
head(airquality)

  OZONE SOLAR.R WIND TEMP MONTH DAY
1 41    190      7.4 67   5     1
2 36    118      8.0 72   5     2
3 12    149     12.6 74   5     3
4 18    313     11.5 62   5     4
5 NA     NA     14.3 56   5     5
6 28     NA     14.9 66   5     6

In [22]:
air_melt <- melt(airquality, id=c("MONTH","DAY"), na.rm=TRUE)
head(air_melt)

  MONTH DAY variable value
1 5     1   OZONE    41
2 5     2   OZONE    36
3 5     3   OZONE    12
4 5     4   OZONE    18
6 5     6   OZONE    28
7 5     7   OZONE    23

In [28]:
# acast() 함수를 이용하여 3차원 구조로 변경
names(air_melt) <- tolower(names(air_melt))
acast <- acast(air_melt, day~month~variable) # 3차원 구조로 변경(?)
acast[,,OZONE]

ERROR: ignored

In [24]:
class(acast)

[1] "array"